{
  "test_info": {
    "restaurant": "Park Ave Pizza",
    "location": "Woonsocket, RI",
    "timestamp": "2025-10-29T11:23:01.769965",
    "competitors_tested": 3
  },
  "statistics": {
    "api_calls_made": 12,
    "reviews_collected": 60,
    "total_cost": 0.20400000000000001,
    "avg_reviews_per_call": 5.0
  },
  "reviews": {
    "All Star Pizza": [
      {
        "author": "Snoozecast",
        "rating": 5,
        "text": "WOW. So good. I live in a “pizza desert” down on the Southcoast of MA, so whenever I’m back in RI I am keen to seek my fill of delicious pizza.  I’ve found my new favorite when I was visiting a friend up in Woonsocket. Friendly service, friendly customers, but best of all- the food. Got the lasagna pizza to take home for dinner tonight with the kids. The crust is so chewy and good. The toppings delicious. Also had a great gyro from there for lunch for my long drive home.  Just wished it had more of the yogurt sauce so when I come again will ask for extra.",
        "date": "2025-10-04T19:39:30",
        "quality_score": 0.5
      },
      {
        "author": "Ella Skye",
        "rating": 5,
        "text": "Omg AMAZING. 🤌 Fresh ingredients, great price, super friendly people, always ready on time, cooked perfectly. 🥰Highly recommend lasagna pizza. But anything really. Have ordered several items on take out menu and EVERYTHING is ALWAYS PERFECT.\nThis place is a hidden GEM!!! 10 stars! EVERYTHING DELICIOUS!",
        "date": "2025-07-18T19:08:20",
        "quality_score": 0.7
      },
      {
        "author": "Isaac Fernandes",
        "rating": 5,
        "text": "All-Star Pizza always on point! Fresh food, top tier customer service, and good energy from the staff overall. I just stopped in to pick up a Pizza Margherita and can’t wait to get home and fill up! Matt provided excellent customer service and was very personable when I arrived. Been a return customer here for the past 3 years living in Woonsocket; highly recommend!",
        "date": "2025-04-24T20:48:22",
        "quality_score": 0.7
      },
      {
        "author": "soufiane tehham",
        "rating": 5,
        "text": "All Star Pizza in Rhode Island exceeded my expectations! The pizza is always fresh, hot, and loaded with delicious toppings. The crust is perfectly cooked—crispy on the outside, soft and chewy on the inside. The staff is friendly, attentive, and makes you feel welcome every time. Delivery is quick and efficient, and the restaurant maintains a clean and comfortable atmosphere. Definitely my go-to spot for pizza in Rhode Island—I highly recommend it!",
        "date": "2025-09-12T00:42:32",
        "quality_score": 0.7
      },
      {
        "author": "Patrick Devine",
        "rating": 5,
        "text": "Edited after repeatedly getting food: First impression, clean. Clean little spot with a good sized menu that isn't overwhelming. The food is delicious. They get their bread fresh from a local bakery. The chicken is NOT frozen. Everything that was supposed to be crispy, was nicely crispy. The chicken wings are KILLER. The veggies were cool and fresh. The chicken was juicy. Their onion rings actually cleanly bite through instead of pulling out the whole onion in one bite. All of the food I have had so far has been awesome. The people working there were very nice. Matt is the employee I usually order with and has had tons of good recommendations and is always ready to tell you about the quality of the food. 10/10 I am going back to try more stuff on the menu",
        "date": "2025-08-21T14:21:37",
        "quality_score": 0.6000000000000001
      },
      {
        "author": "Cruz Colon",
        "rating": 5,
        "text": "Se a convertido en mi pizzeria favorita 😍 la comida siempre fresca, el personal muy atentos con una muy buena energia y una gran sonrisa  .. lo recomiendo al 100✨️✨️",
        "date": "2025-04-08T17:03:48",
        "quality_score": 0.7
      },
      {
        "author": "Zahira Othman",
        "rating": 5,
        "text": "Me encanta la comida de este lugar  es riquísima la pizza tiene un sabor distinto me fascina los chicken tenders con rosemary son mis favoritos y el pollo es real, la pasta alfredo me gusta demasiado la hacen con poca sal y así yo puedo ponerla a mi gusto y cuidar mi salud lo mas posible.  Estoy segura que les encantará la pizza y las comidas de este lugar. Además ofrecen un excelente servicio y el delivery’ llega de acuerdo al tiempo estimado y es muy fácil pedirlo online’ cuando les he pedido algún cambio siempre estan dispuestos, lo mejor de woonsocket sin duda alguna. ✨🍃🫶🏾\nEl chef Najib tremenda persona junto con su equipo de trabajo. Gracias por todo !",
        "date": "2023-01-25T13:09:55",
        "quality_score": 0.4
      },
      {
        "author": "Davelina Rosario",
        "rating": 5,
        "text": "Buena comida y buen precio y bueno personas",
        "date": "2025-08-22T01:53:13",
        "quality_score": 0.6
      },
      {
        "author": "Junior Flecha",
        "rating": 5,
        "text": "Wow... no dejes de visitar este sitio...buen precio y variedad de comidas a buen precio...",
        "date": "2020-12-21T14:38:27",
        "quality_score": 0.7
      },
      {
        "author": "Snoozecast",
        "rating": 5,
        "text": "¡Guau! ¡Qué rico! Vivo en un desierto de pizzas en la costa sur de Massachusetts, así que siempre que vuelvo a Rhode Island me muero de ganas de comer mi pizza deliciosa. Encontré mi nueva favorita cuando visité a un amigo en Woonsocket. Servicio amable, clientes amables, pero lo mejor de todo: la comida. Pedí la pizza de lasaña para llevar a casa a cenar esta noche con los niños. La masa es súper suave y está deliciosa. Los ingredientes deliciosos. También comí un gyro buenísimo de allí para almorzar durante mi largo viaje a casa. Solo me hubiera gustado que tuviera más salsa de yogur, así que cuando vuelva pediré más.",
        "date": "2025-10-04T19:39:30",
        "quality_score": 0.4
      }
    ],
    "Firehouse Pizza Shop II": [
      {
        "author": "Ryan Campbell",
        "rating": 3,
        "text": "It's decent pizza. Fluffy crust. Staff was friendly enough. I'll definitely go again but I'll have to be in the mood for fluffy crust",
        "date": "2025-09-01T20:01:29",
        "quality_score": 0.75
      },
      {
        "author": "Josh Brz",
        "rating": 2,
        "text": "Not good anymore, my steak and cheese sandwich was mostly bread.. not impressed",
        "date": "2025-10-12T02:11:03",
        "quality_score": 0.7
      },
      {
        "author": "mike",
        "rating": 5,
        "text": "ordered 2 blt grinders,cheeseberger,fries,and a steak cheese an mushroom grinders first time there i gotta admit food was awsome !!! and bread was spot on!! gonna be my new # 1spot for now on !!!!!!!!!!! thank u firehouse!",
        "date": "2025-07-10T12:37:55",
        "quality_score": 0.7999999999999999
      },
      {
        "author": "Erica Garceau",
        "rating": 1,
        "text": "ordered a grilled chicken ceasar salad, got a bowl of lettuce w grilled chicken on top. no croutons, no cheese, no salt and pepper and just zero effort. save ya money",
        "date": "2025-06-03T12:23:14",
        "quality_score": 0.75
      },
      {
        "author": "Jodi Marchuk",
        "rating": 4,
        "text": "Order a medium steak cheese and mushrooms. As well as a medium Italian. I ate the steak. Was very good. My boyfriend ate the Italian, which he also liked. There is inside seating which we didn’t use. Opted to go home. Food was still hot when got home. Prices were fair.",
        "date": "2022-09-01T15:13:15",
        "quality_score": 0.85
      },
      {
        "author": "Ryan Campbell",
        "rating": 3,
        "text": "Es una pizza decente. La masa esponjosa. El personal fue bastante amable. Sin duda volveré, pero tendré que estar de humor para una masa esponjosa.",
        "date": "2025-09-01T20:01:29",
        "quality_score": 0.7
      },
      {
        "author": "Josh Brz",
        "rating": 2,
        "text": "Ya no está bueno, mi sándwich de carne y queso era principalmente pan... no me impresiona.",
        "date": "2025-10-12T02:11:03",
        "quality_score": 0.7
      },
      {
        "author": "mike",
        "rating": 5,
        "text": "Pedí dos sándwiches de tocino, lechuga y tomate, una hamburguesa con queso, papas fritas y un sándwich de carne, queso y champiñones. ¡Es la primera vez que voy! ¡Debo admitir que la comida estaba increíble! ¡Y el pan estaba en su punto! ¡Será mi nuevo restaurante número 1 de ahora en adelante! ¡Gracias, Firehouse!",
        "date": "2025-07-10T12:37:55",
        "quality_score": 0.5
      },
      {
        "author": "Erica Garceau",
        "rating": 1,
        "text": "Pedí una ensalada César con pollo a la parrilla y me trajeron un tazón de lechuga con pollo a la parrilla encima. Sin crutones, sin queso, sin sal ni pimienta y sin ningún esfuerzo. Ahorra dinero.",
        "date": "2025-06-03T12:23:14",
        "quality_score": 0.7
      },
      {
        "author": "Jodi Marchuk",
        "rating": 4,
        "text": "Pedí un filete mediano con queso y champiñones. También pedí un italiano mediano. Comí el filete. Estaba muy bueno. Mi novio pidió el italiano, que también le gustó. Hay mesas en el interior que no usamos. Decidimos irnos a casa. La comida aún estaba caliente cuando llegamos. Los precios eran razonables.",
        "date": "2022-09-01T15:13:15",
        "quality_score": 0.5
      }
    ],
    "Bellingham Palace": [
      {
        "author": "Joy Young",
        "rating": 5,
        "text": "I have been coming here for years the food is always wonderful! Although my palate has changed since being a child and ordering chocolate chip pancakes. Today we ordered the Irish Benedict and the chicken and waffles both dishes were phenomenal!! Our server was so friendly and attentive. She even had the kitchen divide each order in to 2 plates so we were able to sample. That was such a great idea.",
        "date": "2025-08-19T16:05:51",
        "quality_score": 0.6
      },
      {
        "author": "Amy Chounlamany",
        "rating": 4,
        "text": "Always a comfortable setting the staff if always sweet and attentive. The food is great classic American breakfast, great lunch and dinner (italian,american,comfort) of and may I just brag about there chicken and waffles the best!",
        "date": "2025-03-20T08:59:25",
        "quality_score": 0.7999999999999999
      },
      {
        "author": "jennifer sanchez",
        "rating": 1,
        "text": "When I opened my plate I said wt* is this! I ordered stuffed French toast which was made with grinder bread 😳 This had to be 6”thick. Like how can anyone eat that. No strawberries inside but they gave me a freezing cold size of strawberries in juice (not sweetened). This was $15. My husbands bacon also looked shredded and fatty. I wanted regular breakfast with beans but saw that a side of beans is $6.29! You can make a 5 quart pot for that price.",
        "date": "2025-02-24T21:39:06",
        "quality_score": 0.6
      },
      {
        "author": "Dee Malle",
        "rating": 3,
        "text": "Used to be great, but honestly the quality of the food as well as the service has gone downhill.  Service used to be friendly, cheerful, now ya barely get a smile from these waitresses.  Had to ask for splenda three times before it finally arrived. And the steak in the steak omelet reminded me of those steakum type things from the freezer section.  Definitely not worth the $20+ that that build your own omelet ended up costing.  Oh, and the prices have gone up drastically too.",
        "date": "2025-09-09T20:19:18",
        "quality_score": 0.7
      },
      {
        "author": "Josh Erwin",
        "rating": 4,
        "text": "Second time coming to this place and haven't been disappointed.\n\nMy girlfriend ordered the steak and eggs with a strawberry mimosa and I had coffee with the Philly cheese steak breakfast.\n\nI must say it was quire enjoyable.",
        "date": "2024-06-22T10:41:59",
        "quality_score": 0.75
      },
      {
        "author": "Joy Young",
        "rating": 5,
        "text": "Llevo años viniendo aquí, ¡y la comida siempre es maravillosa! Aunque mi paladar ha cambiado desde que era niña y pedía panqueques con chispas de chocolate. Hoy pedimos el Benedict irlandés y el pollo con waffles; ¡ambos platos estaban fenomenales! Nuestra camarera fue muy amable y atenta. Incluso hizo que la cocina dividiera cada pedido en dos platos para que pudiéramos probar. ¡Fue una idea genial!",
        "date": "2025-08-19T16:05:51",
        "quality_score": 0.5
      },
      {
        "author": "jennifer sanchez",
        "rating": 1,
        "text": "Cuando abrí el plato, dije: ¡¿Qué es esto?! Pedí tostadas francesas rellenas, hechas con pan de molde 😳. Tenían que ser de 15 cm de grosor. ¿Cómo puede alguien comer eso? No llevaba fresas, pero me dieron unas fresas bien frías en jugo (sin azúcar). Costaba $15. El tocino de mi marido también parecía desmenuzado y grasiento. Quería un desayuno normal con frijoles, pero vi que una guarnición de frijoles cuesta $6.29. ¡Se puede preparar una olla de 5 cuartos por ese precio!",
        "date": "2025-02-24T21:39:06",
        "quality_score": 0.55
      },
      {
        "author": "Dee Malle",
        "rating": 3,
        "text": "Solía ​​ser genial, pero sinceramente, tanto la calidad de la comida como el servicio han decaído. Antes, el servicio era amable y alegre, pero ahora las camareras apenas sonríen. Tuve que pedir Splenda tres veces antes de que por fin llegara. Y el bistec en la tortilla me recordó a esas cosas de la sección de congelados. Definitivamente no vale los más de $20 que costó esa tortilla casera. Ah, y los precios también han subido muchísimo.",
        "date": "2025-09-09T20:19:18",
        "quality_score": 0.5
      },
      {
        "author": "Josh Erwin",
        "rating": 4,
        "text": "Es la segunda vez que vengo a este lugar y no me ha decepcionado.\n\nMi novia pidió el bistec con huevos y una mimosa de fresa, y yo tomé café con el desayuno de filete de queso Filadelfia.\n\nDebo decir que fue bastante agradable.",
        "date": "2024-06-22T10:41:59",
        "quality_score": 0.7
      }
    ]
  }
}